In [2]:
import numpy as np
import pandas as pd

In [3]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [4]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(arr) #arr,labels : displays the labels a,b,c

0    10
1    20
2    30
dtype: int64

In [8]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

using an index

In [9]:
ser = pd.Series([1,2,3,4],index = ['India','USA','Germany','Japan'])
ser

India      1
USA        2
Germany    3
Japan      4
dtype: int64

In [10]:
ser1 = pd.Series([1,2,5,4],index = ['India','USA','Italy','Japan'])
ser1

India    1
USA      2
Italy    5
Japan    4
dtype: int64

In [11]:
ser['India']

np.int64(1)

In [12]:
ser + ser1

Germany    NaN
India      2.0
Italy      NaN
Japan      8.0
USA        4.0
dtype: float64

dataframes

In [13]:
from numpy.random import randn
np.random.seed(100) #seed : pseudo random no generator

In [15]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A  1.618982  1.541605 -0.251879 -0.842436
B  0.184519  0.937082  0.731000  1.361556
C -0.326238  0.055676  0.222400 -1.443217
D -0.756352  0.816454  0.750445 -0.455947
E  1.189622 -1.690617 -1.356399 -1.232435

In [17]:
df.W # or df['W']

A    1.618982
B    0.184519
C   -0.326238
D   -0.756352
E    1.189622
Name: W, dtype: float64

In [18]:
df[['W','Z']]

          W         Z
A  1.618982 -0.842436
B  0.184519  1.361556
C -0.326238 -1.443217
D -0.756352 -0.455947
E  1.189622 -1.232435

In [20]:
df['new'] = df['W'] + df['Y'] #creating a new column 
df

          W         X         Y         Z       new
A  1.618982  1.541605 -0.251879 -0.842436  1.367103
B  0.184519  0.937082  0.731000  1.361556  0.915519
C -0.326238  0.055676  0.222400 -1.443217 -0.103838
D -0.756352  0.816454  0.750445 -0.455947 -0.005908
E  1.189622 -1.690617 -1.356399 -1.232435 -0.166777

In [23]:
df.drop('new',axis=1) #removing new column

          W         X         Y         Z
A  1.618982  1.541605 -0.251879 -0.842436
B  0.184519  0.937082  0.731000  1.361556
C -0.326238  0.055676  0.222400 -1.443217
D -0.756352  0.816454  0.750445 -0.455947
E  1.189622 -1.690617 -1.356399 -1.232435

In [24]:
df.drop('new',axis=1,inplace=True) #inplace modifies the table/object directly 
df

          W         X         Y         Z
A  1.618982  1.541605 -0.251879 -0.842436
B  0.184519  0.937082  0.731000  1.361556
C -0.326238  0.055676  0.222400 -1.443217
D -0.756352  0.816454  0.750445 -0.455947
E  1.189622 -1.690617 -1.356399 -1.232435

In [25]:
df.drop('E',axis=0)

          W         X         Y         Z
A  1.618982  1.541605 -0.251879 -0.842436
B  0.184519  0.937082  0.731000  1.361556
C -0.326238  0.055676  0.222400 -1.443217
D -0.756352  0.816454  0.750445 -0.455947

In [26]:
df.loc['A'] #or df.iloc[0]

W    1.618982
X    1.541605
Y   -0.251879
Z   -0.842436
Name: A, dtype: float64

In [28]:
print(df.loc['B','Y'])

0.7310003438348087

In [30]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  1.618982 -0.251879
B  0.184519  0.731000

In [31]:
df

          W         X         Y         Z
A  1.618982  1.541605 -0.251879 -0.842436
B  0.184519  0.937082  0.731000  1.361556
C -0.326238  0.055676  0.222400 -1.443217
D -0.756352  0.816454  0.750445 -0.455947
E  1.189622 -1.690617 -1.356399 -1.232435

In [32]:
df>0

       W      X      Y      Z
A   True   True  False  False
B   True   True   True   True
C  False   True   True  False
D  False   True   True  False
E   True  False  False  False

In [33]:
df[df>0]

          W         X         Y         Z
A  1.618982  1.541605       NaN       NaN
B  0.184519  0.937082  0.731000  1.361556
C       NaN  0.055676  0.222400       NaN
D       NaN  0.816454  0.750445       NaN
E  1.189622       NaN       NaN       NaN

In [34]:
df[df['W']>0]

          W         X         Y         Z
A  1.618982  1.541605 -0.251879 -0.842436
B  0.184519  0.937082  0.731000  1.361556
E  1.189622 -1.690617 -1.356399 -1.232435

In [36]:
df[df['W']>0]['Y']

A   -0.251879
B    0.731000
E   -1.356399
Name: Y, dtype: float64

In [39]:
df[(df['W']>0) & (df['Y']>0)]

          W         X      Y         Z
B  0.184519  0.937082  0.731  1.361556

In [40]:
df

          W         X         Y         Z
A  1.618982  1.541605 -0.251879 -0.842436
B  0.184519  0.937082  0.731000  1.361556
C -0.326238  0.055676  0.222400 -1.443217
D -0.756352  0.816454  0.750445 -0.455947
E  1.189622 -1.690617 -1.356399 -1.232435

In [41]:
df.reset_index()

  index         W         X         Y         Z
0     A  1.618982  1.541605 -0.251879 -0.842436
1     B  0.184519  0.937082  0.731000  1.361556
2     C -0.326238  0.055676  0.222400 -1.443217
3     D -0.756352  0.816454  0.750445 -0.455947
4     E  1.189622 -1.690617 -1.356399 -1.232435

In [58]:
newind = 'KAR MUM DEL HYD TN'.split()
df['States'] = newind
df

               W         X         Y         Z States
States
KAR     1.618982  1.541605 -0.251879 -0.842436    KAR
MUM     0.184519  0.937082  0.731000  1.361556    MUM
DEL    -0.326238  0.055676  0.222400 -1.443217    DEL
HYD    -0.756352  0.816454  0.750445 -0.455947    HYD
TN      1.189622 -1.690617 -1.356399 -1.232435     TN

In [59]:
df.set_index('States')

               W         X         Y         Z
States
KAR     1.618982  1.541605 -0.251879 -0.842436
MUM     0.184519  0.937082  0.731000  1.361556
DEL    -0.326238  0.055676  0.222400 -1.443217
HYD    -0.756352  0.816454  0.750445 -0.455947
TN      1.189622 -1.690617 -1.356399 -1.232435

.

In [64]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [65]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [66]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1 -0.544439 -0.668172
   2  0.007315 -0.612939
   3  1.299748 -1.733096
G2 1 -0.983310  0.357508
   2 -1.613579  1.470714
   3 -1.188018 -0.549746

In [67]:
df.loc['G1']

          A         B
1 -0.544439 -0.668172
2  0.007315 -0.612939
3  1.299748 -1.733096

In [70]:
df.loc['G1'].loc[1]

A   -0.544439
B   -0.668172
Name: 1, dtype: float64

In [71]:
df.index.names

FrozenList([None, None])

In [72]:
df.index.names = ['Group','Numbers']
df

                      A         B
Group Numbers
G1    1       -0.544439 -0.668172
      2        0.007315 -0.612939
      3        1.299748 -1.733096
G2    1       -0.983310  0.357508
      2       -1.613579  1.470714
      3       -1.188018 -0.549746

In [73]:
df.loc['G1'] #df.xs('G1')

                A         B
Numbers
1       -0.544439 -0.668172
2        0.007315 -0.612939
3        1.299748 -1.733096

In [75]:
df.loc['G1',1]

A   -0.544439
B   -0.668172
Name: (G1, 1), dtype: float64

In [78]:
df.xs(1,level='Numbers')

              A         B
Group
G1    -0.544439 -0.668172
G2    -0.983310  0.357508

missing data/values

In [84]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [85]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [86]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [87]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [88]:
df.fillna(value='Fill Value')

            A           B  C
0         1.0         5.0  1
1         2.0  Fill Value  2
2  Fill Value  Fill Value  3

In [89]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

Merging, joining and concatenating

In [97]:
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3'],
                   'C':['C0','C1','C2','C3'],
                   'D':['D0','D1','D2','D3']},
                  index=[0,1,2,3])

In [98]:
df2 = pd.DataFrame({'A':['A4','A5','A6','A7'],
                   'B':['B4','B5','B6','B7'],
                   'C':['C4','C5','C6','C7'],
                   'D':['D4','D5','D6','D7']},
                  index=[4,5,6,7])

In [99]:
df3 = pd.DataFrame({'A':['A8','A9','A10','A11'],
                   'B':['B8','B9','B10','B11'],
                   'C':['C8','C9','C10','C11'],
                   'D':['D8','D9','D10','D11']},
                  index=[8,9,10,11])

In [100]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [101]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [103]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [104]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [105]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [107]:
left = pd.DataFrame({'key':['K0','K1','K2','K3'],
                    'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3']})

right = pd.DataFrame({'key':['K0','K1','K2','K3'],
                     'C':['C0','C1','C2','C3'],
                     'D':['D0','D1','D2','D3']})

In [108]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [109]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [110]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [111]:
left = pd.DataFrame({'A':['A0','A1','A2'],
                    'B':['B0','B1','B2']},
                   index=['K0','K1','K2'])

right = pd.DataFrame({'C':['A0','A2','A3'],
                    'D':['B0','B2','B3']},
                   index=['K0','K2','K3'])

In [112]:
left.join(right)

     A   B    C    D
K0  A0  B0   A0   B0
K1  A1  B1  NaN  NaN
K2  A2  B2   A2   B2

In [113]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   A0   B0
K1   A1   B1  NaN  NaN
K2   A2   B2   A2   B2
K3  NaN  NaN   A3   B3